// Задайте двумерный массив. Найдите элементы, у которых оба индекса чётные, и замените эти элементы на их квадраты.

Console.Write("Введите количество строк в массиве: ");
int row = int.Parse(Console.ReadLine());
Console.Write("Введите количество столбцов в массиве: ");
int col = int.Parse(Console.ReadLine());
int[,] mass = new int[row, col];

void Print(int[,] arr)
{
    for (int i = 0; i < arr.GetLength(0); i++)
    {
        for (int j = 0; j < arr.GetLength(1); j++)
        {            
            Console.Write(arr[i, j] + " ");
        }
        Console.WriteLine();
    }
}

void Fill(int[,] arr)
{
for (int i = 0; i < arr.GetLength(0); i++)
{
    for (int j = 0; j < arr.GetLength(1); j++)
    {
        arr[i, j] = new Random().Next(0, 10);
    }
}
}

void FindEvenIdx (int[,] arr)
{
for (int i = 0; i < arr.GetLength(0); i+=2)
{
    for (int j = 0; j < arr.GetLength(1); j+=2)
    {
        arr[i,j]=arr[i,j]*arr[i,j];        
    }
}
}
Fill(mass);
Print(mass);
Console.WriteLine();
FindEvenIdx(mass);
Print(mass);