//-------------------------------------------------------------------------------------------------------
// Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
//-------------------------------------------------------------------------------------------------------
Console.Write("Введите число: ");
int A = int.Parse(Console.ReadLine());
Console.Write($"Введите стпепнь в которую возвести число {A}: ");
int B = int.Parse(Console.ReadLine());
int pow = A;
for (int i=1; i<B; i++)
{
    pow = pow * A; 
}
Console.WriteLine($"Результат возведения {A} в степень {B}: {pow}.");

//--------------------------------------------------------------------------------
//Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
//--------------------------------------------------------------------------------
Console.Write("Введите число: ");
int A = int.Parse(Console.ReadLine());

int digits = 1;
int tmp = A;
int sum = 0;
while (A > 0)
{
    sum += A % 10;
    A = A / 10;
}
Console.Write($"Сумма цифр в числе {tmp} равна {sum}");
//--------------------------------------------------------------------------------
// Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
//--------------------------------------------------------------------------------
void PrintArray(int[] array)
{
    for (int i = 0; i < array.Length; i++)
    {
        Console.Write(array[i] + " ");
    }
    Console.WriteLine();
}

void FillArray(int[] array)
{
    for (int i = 0; i < array.Length; i++)
    {
        array[i] = new Random().Next(0, 10);
    }
}

int[] mass = new int[8];
FillArray(mass);
Console.Write("Созданный массив: ");
PrintArray(mass);