// Задайте двумерный массив. Найдите сумму элементов, находящихся на главной диагонали (с индексами (0,0); (1;1) и т.д.

void Print(int[,] arr)
{
    for (int i = 0; i < arr.GetLength(0); i++)
    {
        for (int j = 0; j < arr.GetLength(1); j++)
        {            
            Console.Write(arr[i, j] + " ");
        }
        Console.WriteLine();
    }
}

void Fill(int[,] arr)
{
    for (int i = 0; i < arr.GetLength(0); i++)
    {
        for (int j = 0; j < arr.GetLength(1); j++)
        {
            arr[i, j] = new Random().Next(0, 10);
        }
    }
}

int DiagSum(int[,] arr)
{
    int diagSum = 0;
    int minSize=Math.Min(arr.GetLength(0), arr.GetLength(1));    
    for (int i = 0; i < minSize; i++)
    {
        diagSum += arr[i, i];
    }
    return diagSum;
}

Console.Write("Введите количество строк в массиве: ");
int row = int.Parse(Console.ReadLine());
Console.Write("Введите количество столбцов в массиве: ");
int col = int.Parse(Console.ReadLine());
int[,] mass = new int[row, col];
Fill(mass);
Print(mass);
Console.WriteLine();
DiagSum(mass);
Console.WriteLine($"Сумма элементов главной диагонали равна: {DiagSum(mass)}.");